/* automatically generated by rust-bindgen */

pub const IPP_PI: f64 = 3.141592653589793;
pub const IPP_2PI: f64 = 6.283185307179586;
pub const IPP_PI2: f64 = 1.5707963267948966;
pub const IPP_PI4: f64 = 0.7853981633974483;
pub const IPP_PI180: f64 = 0.017453292519943295;
pub const IPP_RPI: f64 = 0.3183098861837907;
pub const IPP_SQRT2: f64 = 1.4142135623730951;
pub const IPP_SQRT3: f64 = 1.7320508075688772;
pub const IPP_LN2: f64 = 0.6931471805599453;
pub const IPP_LN3: f64 = 1.0986122886681098;
pub const IPP_E: f64 = 2.718281828459045;
pub const IPP_RE: f64 = 0.36787944117144233;
pub const IPP_MAX_8U: u32 = 255;
pub const IPP_MAX_16U: u32 = 65535;
pub const IPP_MAX_32U: u32 = 4294967295;
pub const IPP_MIN_8U: u32 = 0;
pub const IPP_MIN_16U: u32 = 0;
pub const IPP_MIN_32U: u32 = 0;
pub const IPP_MIN_8S: i32 = -128;
pub const IPP_MAX_8S: u32 = 127;
pub const IPP_MIN_16S: i32 = -32768;
pub const IPP_MAX_16S: u32 = 32767;
pub const IPP_MIN_32S: i32 = -2147483648;
pub const IPP_MAX_32S: u32 = 2147483647;
pub const IPP_MIN_64U: u32 = 0;
pub const IPP_MAX_64S: u64 = 9223372036854775807;
pub const IPP_MIN_64S: i64 = -9223372036854775808;
pub const IPP_MAX_64U: i32 = -1;
pub const ippCPUID_MMX: u32 = 1;
pub const ippCPUID_SSE: u32 = 2;
pub const ippCPUID_SSE2: u32 = 4;
pub const ippCPUID_SSE3: u32 = 8;
pub const ippCPUID_SSSE3: u32 = 16;
pub const ippCPUID_MOVBE: u32 = 32;
pub const ippCPUID_SSE41: u32 = 64;
pub const ippCPUID_SSE42: u32 = 128;
pub const ippCPUID_AVX: u32 = 256;

pub const ippStsPaddingErr: i32 = -1004;
pub const ippStsCFBSizeErr: i32 = -1003;
pub const ippStsPaddingSchemeErr: i32 = -1002;
pub const ippStsBadModulusErr: i32 = -1001;
pub const ippStsInsufficientEntropy: u32 = 25;
pub const ippStsNotSupportedCpu: u32 = 36;
pub const DES_BLOCKSIZE: u32 = 64;
pub const TDES_BLOCKSIZE: u32 = 64;
pub const DES_KEYSIZE: u32 = 64;
pub const TDES_KEYSIZE: u32 = 64;
pub const IPP_AES_BLOCK_BITSIZE: u32 = 128;
pub const IPP_ARCFOUR_KEYMAX_SIZE: u32 = 256;
pub const MAX_ARCFOUR_KEY_LEN: u32 = 256;
pub const IPP_SHA1_DIGEST_BITSIZE: u32 = 160;
pub const IPP_SHA256_DIGEST_BITSIZE: u32 = 256;
pub const IPP_SHA224_DIGEST_BITSIZE: u32 = 224;
pub const IPP_SHA384_DIGEST_BITSIZE: u32 = 384;
pub const IPP_SHA512_DIGEST_BITSIZE: u32 = 512;
pub const IPP_MD5_DIGEST_BITSIZE: u32 = 128;
pub const IPP_SM3_DIGEST_BITSIZE: u32 = 256;
pub const IPP_SHA512_224_DIGEST_BITSIZE: u32 = 224;
pub const IPP_SHA512_256_DIGEST_BITSIZE: u32 = 256;
pub const BN_MAXBITSIZE: u32 = 16384;
pub const IPP_IS_EQ: u32 = 0;
pub const IPP_IS_GT: u32 = 1;
pub const IPP_IS_LT: u32 = 2;
pub const IPP_IS_NE: u32 = 3;
pub const IPP_IS_NA: u32 = 4;
pub const IPP_IS_PRIME: u32 = 5;
pub const IPP_IS_COMPOSITE: u32 = 6;
pub const IPP_IS_VALID: u32 = 7;
pub const IPP_IS_INVALID: u32 = 8;
pub const IPP_IS_INCOMPLETE: u32 = 9;
pub const IPP_IS_ATINFINITY: u32 = 10;
pub const IS_ZERO: u32 = 0;
pub const GREATER_THAN_ZERO: u32 = 1;
pub const LESS_THAN_ZERO: u32 = 2;
pub const IS_PRIME: u32 = 5;
pub const IS_COMPOSITE: u32 = 6;
pub const IS_VALID_KEY: u32 = 7;
pub const IS_INVALID_KEY: u32 = 8;
pub const IS_INCOMPLETED_KEY: u32 = 9;
pub const MIN_RSA_SIZE: u32 = 8;
pub const MAX_RSA_SIZE: u32 = 16384;
pub const MIN_DLP_BITSIZE: u32 = 512;
pub const MIN_DLP_BITSIZER: u32 = 160;
pub const MIN_DLPDH_BITSIZE: u32 = 512;
pub const MIN_DLPDH_BITSIZER: u32 = 160;
pub const DEF_DLPDH_BITSIZER: u32 = 160;
pub const MIN_DLPDSA_BITSIZE: u32 = 512;
pub const MAX_DLPDSA_BITSIZE: u32 = 1024;
pub const MIN_DLPDSA_BITSIZER: u32 = 160;
pub const DEF_DLPDSA_BITSIZER: u32 = 160;
pub const MAX_DLPDSA_BITSIZER: u32 = 160;
pub const MIN_DLPDSA_SEEDSIZE: u32 = 160;
pub const EC_GFP_MAXBITSIZE: u32 = 1024;
pub const IPP_MIN_GF_CHAR: u32 = 3;
pub const IPP_MIN_GF_BITSIZE: u32 = 2;
pub const IPP_MAX_GF_BITSIZE: u32 = 1024;
pub const IPP_MIN_GF_EXTDEG: u32 = 2;
pub const IPP_MAX_GF_EXTDEG: u32 = 8;
pub const IPP_MAX_EXPONENT_NUM: u32 = 6;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct IppLibraryVersion {
    pub major: ::std::os::raw::c_int,
    pub minor: ::std::os::raw::c_int,
    pub majorBuild: ::std::os::raw::c_int,
    pub build: ::std::os::raw::c_int,
    pub targetCpu: [::std::os::raw::c_char; 4usize],
    pub Name: *const ::std::os::raw::c_char,
    pub Version: *const ::std::os::raw::c_char,
    pub BuildDate: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_IppLibraryVersion() {
    assert_eq!(
        ::std::mem::size_of::<IppLibraryVersion>(),
        48usize,
        concat!("Size of: ", stringify!(IppLibraryVersion))
    );
    assert_eq!(
        ::std::mem::align_of::<IppLibraryVersion>(),
        8usize,
        concat!("Alignment of ", stringify!(IppLibraryVersion))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).majorBuild as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(majorBuild)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).build as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(build)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).targetCpu as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(targetCpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).Name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).Version as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppLibraryVersion>())).BuildDate as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(IppLibraryVersion),
            "::",
            stringify!(BuildDate)
        )
    );
}
pub type Ipp8u = ::std::os::raw::c_uchar;
pub type Ipp16u = ::std::os::raw::c_ushort;
pub type Ipp32u = ::std::os::raw::c_uint;
pub type Ipp8s = ::std::os::raw::c_schar;
pub type Ipp16s = ::std::os::raw::c_short;
pub type Ipp32s = ::std::os::raw::c_int;
pub type Ipp32f = f32;
pub type Ipp64s = ::std::os::raw::c_longlong;
pub type Ipp64u = ::std::os::raw::c_ulonglong;
pub type Ipp64f = f64;
pub type Ipp16f = Ipp16s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp8sc {
    pub re: Ipp8s,
    pub im: Ipp8s,
}
#[test]
fn bindgen_test_layout_Ipp8sc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp8sc>(),
        2usize,
        concat!("Size of: ", stringify!(Ipp8sc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp8sc>(),
        1usize,
        concat!("Alignment of ", stringify!(Ipp8sc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp8sc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp8sc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp8sc>())).im as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp8sc),
            "::",
            stringify!(im)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp16sc {
    pub re: Ipp16s,
    pub im: Ipp16s,
}
#[test]
fn bindgen_test_layout_Ipp16sc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp16sc>(),
        4usize,
        concat!("Size of: ", stringify!(Ipp16sc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp16sc>(),
        2usize,
        concat!("Alignment of ", stringify!(Ipp16sc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp16sc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp16sc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp16sc>())).im as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp16sc),
            "::",
            stringify!(im)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp16uc {
    pub re: Ipp16u,
    pub im: Ipp16u,
}
#[test]
fn bindgen_test_layout_Ipp16uc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp16uc>(),
        4usize,
        concat!("Size of: ", stringify!(Ipp16uc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp16uc>(),
        2usize,
        concat!("Alignment of ", stringify!(Ipp16uc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp16uc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp16uc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp16uc>())).im as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp16uc),
            "::",
            stringify!(im)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp32sc {
    pub re: Ipp32s,
    pub im: Ipp32s,
}
#[test]
fn bindgen_test_layout_Ipp32sc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp32sc>(),
        8usize,
        concat!("Size of: ", stringify!(Ipp32sc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp32sc>(),
        4usize,
        concat!("Alignment of ", stringify!(Ipp32sc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp32sc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp32sc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp32sc>())).im as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp32sc),
            "::",
            stringify!(im)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp32fc {
    pub re: Ipp32f,
    pub im: Ipp32f,
}
#[test]
fn bindgen_test_layout_Ipp32fc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp32fc>(),
        8usize,
        concat!("Size of: ", stringify!(Ipp32fc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp32fc>(),
        4usize,
        concat!("Alignment of ", stringify!(Ipp32fc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp32fc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp32fc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp32fc>())).im as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp32fc),
            "::",
            stringify!(im)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp64sc {
    pub re: Ipp64s,
    pub im: Ipp64s,
}
#[test]
fn bindgen_test_layout_Ipp64sc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp64sc>(),
        16usize,
        concat!("Size of: ", stringify!(Ipp64sc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp64sc>(),
        8usize,
        concat!("Alignment of ", stringify!(Ipp64sc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp64sc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp64sc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp64sc>())).im as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp64sc),
            "::",
            stringify!(im)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Ipp64fc {
    pub re: Ipp64f,
    pub im: Ipp64f,
}
#[test]
fn bindgen_test_layout_Ipp64fc() {
    assert_eq!(
        ::std::mem::size_of::<Ipp64fc>(),
        16usize,
        concat!("Size of: ", stringify!(Ipp64fc))
    );
    assert_eq!(
        ::std::mem::align_of::<Ipp64fc>(),
        8usize,
        concat!("Alignment of ", stringify!(Ipp64fc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp64fc>())).re as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp64fc),
            "::",
            stringify!(re)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Ipp64fc>())).im as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Ipp64fc),
            "::",
            stringify!(im)
        )
    );
}
pub mod IppDataType {
    pub type Type = i32;
    pub const ippUndef: Type = -1;
    pub const ipp1u: Type = 0;
    pub const ipp8u: Type = 1;
    pub const ipp8uc: Type = 2;
    pub const ipp8s: Type = 3;
    pub const ipp8sc: Type = 4;
    pub const ipp16u: Type = 5;
    pub const ipp16uc: Type = 6;
    pub const ipp16s: Type = 7;
    pub const ipp16sc: Type = 8;
    pub const ipp32u: Type = 9;
    pub const ipp32uc: Type = 10;
    pub const ipp32s: Type = 11;
    pub const ipp32sc: Type = 12;
    pub const ipp32f: Type = 13;
    pub const ipp32fc: Type = 14;
    pub const ipp64u: Type = 15;
    pub const ipp64uc: Type = 16;
    pub const ipp64s: Type = 17;
    pub const ipp64sc: Type = 18;
    pub const ipp64f: Type = 19;
    pub const ipp64fc: Type = 20;
}
pub mod IppBool {
    pub type Type = u32;
    pub const ippFalse: Type = 0;
    pub const ippTrue: Type = 1;
}
pub type IppStatus = ::std::os::raw::c_int;
pub type IppAlgId = Ipp32u;
pub mod IppsPadding {
    pub type Type = u32;
    pub const ippPaddingNONE: Type = 0;
    pub const IppsCPPaddingNONE: Type = 0;
    pub const ippPaddingPKCS7: Type = 1;
    pub const IppsCPPaddingPKCS7: Type = 1;
    pub const ippPaddingZEROS: Type = 2;
    pub const IppsCPPaddingZEROS: Type = 2;
}
pub use self::IppsPadding::Type as IppsCPPadding;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpDES {
    _unused: [u8; 0],
}
pub type IppsDESSpec = _cpDES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpRijndael128 {
    _unused: [u8; 0],
}
pub type IppsAESSpec = _cpRijndael128;
pub type IppsRijndael128Spec = _cpRijndael128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpSMS4 {
    _unused: [u8; 0],
}
pub type IppsSMS4Spec = _cpSMS4;
pub mod IppsRijndaelKeyLength {
    pub type Type = u32;
    pub const ippRijndaelKey128: Type = 128;
    pub const IppsRijndaelKey128: Type = 128;
    pub const ippRijndaelKey192: Type = 192;
    pub const IppsRijndaelKey192: Type = 192;
    pub const ippRijndaelKey256: Type = 256;
    pub const IppsRijndaelKey256: Type = 256;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpAES_CCM {
    _unused: [u8; 0],
}
pub type IppsAES_CCMState = _cpAES_CCM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpAES_GCM {
    _unused: [u8; 0],
}
pub type IppsAES_GCMState = _cpAES_GCM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpAES_XTS {
    _unused: [u8; 0],
}
pub type IppsAES_XTSSpec = _cpAES_XTS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpSMS4_CCM {
    _unused: [u8; 0],
}
pub type IppsSMS4_CCMState = _cpSMS4_CCM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpARCfour {
    _unused: [u8; 0],
}
pub type IppsARCFourState = _cpARCfour;
pub mod IppHashAlgId {
    pub type Type = u32;
    pub const ippHashAlg_Unknown: Type = 0;
    pub const ippHashAlg_SHA1: Type = 1;
    pub const ippHashAlg_SHA256: Type = 2;
    pub const ippHashAlg_SHA224: Type = 3;
    pub const ippHashAlg_SHA512: Type = 4;
    pub const ippHashAlg_SHA384: Type = 5;
    pub const ippHashAlg_MD5: Type = 6;
    pub const ippHashAlg_SM3: Type = 7;
    pub const ippHashAlg_SHA512_224: Type = 8;
    pub const ippHashAlg_SHA512_256: Type = 9;
    pub const ippHashAlg_MaxNo: Type = 10;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpSHA1 {
    _unused: [u8; 0],
}
pub type IppsSHA1State = _cpSHA1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpSHA256 {
    _unused: [u8; 0],
}
pub type IppsSHA256State = _cpSHA256;
pub type IppsSHA224State = _cpSHA256;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpSHA512 {
    _unused: [u8; 0],
}
pub type IppsSHA512State = _cpSHA512;
pub type IppsSHA384State = _cpSHA512;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpMD5 {
    _unused: [u8; 0],
}
pub type IppsMD5State = _cpMD5;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpSM3 {
    _unused: [u8; 0],
}
pub type IppsSM3State = _cpSM3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpHashCtx {
    _unused: [u8; 0],
}
pub type IppsHashState = _cpHashCtx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpHashMethod_rmf {
    _unused: [u8; 0],
}
pub type IppsHashMethod = _cpHashMethod_rmf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpHashCtx_rmf {
    _unused: [u8; 0],
}
pub type IppsHashState_rmf = _cpHashCtx_rmf;
pub type IppMGF = ::std::option::Option<
    unsafe extern "C" fn(
        pSeed: *const Ipp8u,
        seedLen: ::std::os::raw::c_int,
        pMask: *mut Ipp8u,
        maskLen: ::std::os::raw::c_int,
    ) -> IppStatus,
>;
pub type IppHASH = ::std::option::Option<
    unsafe extern "C" fn(
        pMsg: *const Ipp8u,
        len: ::std::os::raw::c_int,
        pMD: *mut Ipp8u,
    ) -> IppStatus,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpHMAC {
    _unused: [u8; 0],
}
pub type IppsHMACState = _cpHMAC;
pub type IppsHMACSHA1State = _cpHMAC;
pub type IppsHMACSHA256State = _cpHMAC;
pub type IppsHMACSHA224State = _cpHMAC;
pub type IppsHMACSHA384State = _cpHMAC;
pub type IppsHMACSHA512State = _cpHMAC;
pub type IppsHMACMD5State = _cpHMAC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpHMAC_rmf {
    _unused: [u8; 0],
}
pub type IppsHMACState_rmf = _cpHMAC_rmf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpAES_CMAC {
    _unused: [u8; 0],
}
pub type IppsAES_CMACState = _cpAES_CMAC;
pub mod IppsBigNumSGN {
    pub type Type = u32;
    pub const ippBigNumNEG: Type = 0;
    pub const IppsBigNumNEG: Type = 0;
    pub const ippBigNumPOS: Type = 1;
    pub const IppsBigNumPOS: Type = 1;
}
pub mod IppsExpMethod {
    pub type Type = u32;
    pub const ippBinaryMethod: Type = 0;
    pub const IppsBinaryMethod: Type = 0;
    pub const ippSlidingWindows: Type = 1;
    pub const IppsSlidingWindows: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpBigNum {
    _unused: [u8; 0],
}
pub type IppsBigNumState = _cpBigNum;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpMontgomery {
    _unused: [u8; 0],
}
pub type IppsMontState = _cpMontgomery;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpPRNG {
    _unused: [u8; 0],
}
pub type IppsPRNGState = _cpPRNG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpPrime {
    _unused: [u8; 0],
}
pub type IppsPrimeState = _cpPrime;
pub type IppBitSupplier = ::std::option::Option<
    unsafe extern "C" fn(
        pRand: *mut Ipp32u,
        nBits: ::std::os::raw::c_int,
        pEbsParams: *mut ::std::os::raw::c_void,
    ) -> IppStatus,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpRSA {
    _unused: [u8; 0],
}
pub type IppsRSAState = _cpRSA;
pub mod IppRSAKeyType {
    pub type Type = u32;
    pub const ippRSApublic: Type = 536870912;
    pub const IppRSApublic: Type = 536870912;
    pub const ippRSAprivate: Type = 1073741824;
    pub const IppRSAprivate: Type = 1073741824;
}
pub mod IppRSAKeyTag {
    pub type Type = u32;
    pub const ippRSAkeyN: Type = 1;
    pub const IppRSAkeyN: Type = 1;
    pub const ippRSAkeyE: Type = 2;
    pub const IppRSAkeyE: Type = 2;
    pub const ippRSAkeyD: Type = 4;
    pub const IppRSAkeyD: Type = 4;
    pub const ippRSAkeyP: Type = 8;
    pub const IppRSAkeyP: Type = 8;
    pub const ippRSAkeyQ: Type = 16;
    pub const IppRSAkeyQ: Type = 16;
    pub const ippRSAkeyDp: Type = 32;
    pub const IppRSAkeyDp: Type = 32;
    pub const ippRSAkeyDq: Type = 64;
    pub const IppRSAkeyDq: Type = 64;
    pub const ippRSAkeyQinv: Type = 128;
    pub const IppRSAkeyQinv: Type = 128;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpRSA_public_key {
    _unused: [u8; 0],
}
pub type IppsRSAPublicKeyState = _cpRSA_public_key;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpRSA_private_key {
    _unused: [u8; 0],
}
pub type IppsRSAPrivateKeyState = _cpRSA_private_key;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpDLP {
    _unused: [u8; 0],
}
pub type IppsDLPState = _cpDLP;
pub mod IppDLPKeyTag {
    pub type Type = u32;
    pub const ippDLPkeyP: Type = 1;
    pub const IppDLPkeyP: Type = 1;
    pub const ippDLPkeyR: Type = 2;
    pub const IppDLPkeyR: Type = 2;
    pub const ippDLPkeyG: Type = 4;
    pub const IppDLPkeyG: Type = 4;
}
pub mod IppDLResult {
    pub type Type = u32;
    pub const ippDLValid: Type = 0;
    pub const ippDLBaseIsEven: Type = 1;
    pub const ippDLOrderIsEven: Type = 2;
    pub const ippDLInvalidBaseRange: Type = 3;
    pub const ippDLInvalidOrderRange: Type = 4;
    pub const ippDLCompositeBase: Type = 5;
    pub const ippDLCompositeOrder: Type = 6;
    pub const ippDLInvalidCofactor: Type = 7;
    pub const ippDLInvalidGenerator: Type = 8;
    pub const ippDLInvalidPrivateKey: Type = 9;
    pub const ippDLInvalidPublicKey: Type = 10;
    pub const ippDLInvalidKeyPair: Type = 11;
    pub const ippDLInvalidSignature: Type = 12;
}
pub mod IppECResult {
    pub type Type = u32;
    pub const ippECValid: Type = 0;
    pub const ippECCompositeBase: Type = 1;
    pub const ippECComplicatedBase: Type = 2;
    pub const ippECIsZeroDiscriminant: Type = 3;
    pub const ippECCompositeOrder: Type = 4;
    pub const ippECInvalidOrder: Type = 5;
    pub const ippECIsWeakMOV: Type = 6;
    pub const ippECIsWeakSSSA: Type = 7;
    pub const ippECIsSupersingular: Type = 8;
    pub const ippECInvalidPrivateKey: Type = 9;
    pub const ippECInvalidPublicKey: Type = 10;
    pub const ippECInvalidKeyPair: Type = 11;
    pub const ippECPointOutOfGroup: Type = 12;
    pub const ippECPointIsAtInfinite: Type = 13;
    pub const ippECPointIsNotValid: Type = 14;
    pub const ippECPointIsEqual: Type = 15;
    pub const ippECPointIsNotEqual: Type = 16;
    pub const ippECInvalidSignature: Type = 17;
}
pub mod IppsECType {
    pub type Type = u32;
    pub const ippECarbitrary: Type = 0;
    pub const IppECCArbitrary: Type = 0;
    pub const ippECPstd: Type = 65536;
    pub const IppECCPStd: Type = 65536;
    pub const ippECPstd112r1: Type = 65536;
    pub const IppECCPStd112r1: Type = 65536;
    pub const ippECPstd112r2: Type = 65537;
    pub const IppECCPStd112r2: Type = 65537;
    pub const ippECPstd128r1: Type = 65538;
    pub const IppECCPStd128r1: Type = 65538;
    pub const ippECPstd128r2: Type = 65539;
    pub const IppECCPStd128r2: Type = 65539;
    pub const ippECPstd160r1: Type = 65540;
    pub const IppECCPStd160r1: Type = 65540;
    pub const ippECPstd160r2: Type = 65541;
    pub const IppECCPStd160r2: Type = 65541;
    pub const ippECPstd192r1: Type = 65542;
    pub const IppECCPStd192r1: Type = 65542;
    pub const ippECPstd224r1: Type = 65543;
    pub const IppECCPStd224r1: Type = 65543;
    pub const ippECPstd256r1: Type = 65544;
    pub const IppECCPStd256r1: Type = 65544;
    pub const ippECPstd384r1: Type = 65545;
    pub const IppECCPStd384r1: Type = 65545;
    pub const ippECPstd521r1: Type = 65546;
    pub const IppECCPStd521r1: Type = 65546;
    pub const ippECPstdSM2: Type = 65547;
    pub const IppECCPStdSM2: Type = 65547;
    pub const ippEC_TPM_SM2_P256: Type = 65547;
    pub const ippEC_TPM_BN_P256: Type = 65548;
    pub const IppECCBStd: Type = 131072;
    pub const IppECCBStd113r1: Type = 131072;
    pub const IppECCBStd113r2: Type = 131073;
    pub const IppECCBStd131r1: Type = 131074;
    pub const IppECCBStd131r2: Type = 131075;
    pub const IppECCBStd163r1: Type = 131076;
    pub const IppECCBStd163r2: Type = 131077;
    pub const IppECCBStd193r1: Type = 131078;
    pub const IppECCBStd193r2: Type = 131079;
    pub const IppECCBStd233r1: Type = 131080;
    pub const IppECCBStd283r1: Type = 131081;
    pub const IppECCBStd409r1: Type = 131082;
    pub const IppECCBStd571r1: Type = 131083;
    pub const IppECCKStd: Type = 262144;
    pub const IppECCBStd163k1: Type = 262144;
    pub const IppECCBStd233k1: Type = 262145;
    pub const IppECCBStd239k1: Type = 262146;
    pub const IppECCBStd283k1: Type = 262147;
    pub const IppECCBStd409k1: Type = 262148;
    pub const IppECCBStd571k1: Type = 262149;
}
pub use self::IppsECType::Type as IppECCType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpGFpMethod {
    _unused: [u8; 0],
}
pub type IppsGFpMethod = _cpGFpMethod;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpGFp {
    _unused: [u8; 0],
}
pub type IppsGFpState = _cpGFp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpGFpElement {
    _unused: [u8; 0],
}
pub type IppsGFpElement = _cpGFpElement;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpGFpEC {
    _unused: [u8; 0],
}
pub type IppsGFpECState = _cpGFpEC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpGFpECPoint {
    _unused: [u8; 0],
}
pub type IppsGFpECPoint = _cpGFpECPoint;
pub type IppsECCPState = _cpGFpEC;
pub type IppsECCPPointState = _cpGFpECPoint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct IppsHashInfo {
    pub hashSize: ::std::os::raw::c_int,
    pub msgBlockSize: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_IppsHashInfo() {
    assert_eq!(
        ::std::mem::size_of::<IppsHashInfo>(),
        8usize,
        concat!("Size of: ", stringify!(IppsHashInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<IppsHashInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(IppsHashInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppsHashInfo>())).hashSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IppsHashInfo),
            "::",
            stringify!(hashSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppsHashInfo>())).msgBlockSize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IppsHashInfo),
            "::",
            stringify!(msgBlockSize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct IppsGFpInfo {
    pub parentGFdegree: ::std::os::raw::c_int,
    pub basicGFdegree: ::std::os::raw::c_int,
    pub basicElmBitSize: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_IppsGFpInfo() {
    assert_eq!(
        ::std::mem::size_of::<IppsGFpInfo>(),
        12usize,
        concat!("Size of: ", stringify!(IppsGFpInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<IppsGFpInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(IppsGFpInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppsGFpInfo>())).parentGFdegree as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IppsGFpInfo),
            "::",
            stringify!(parentGFdegree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppsGFpInfo>())).basicGFdegree as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IppsGFpInfo),
            "::",
            stringify!(basicGFdegree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IppsGFpInfo>())).basicElmBitSize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IppsGFpInfo),
            "::",
            stringify!(basicElmBitSize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpStateECES_SM2 {
    _unused: [u8; 0],
}
pub type IppsECESState_SM2 = _cpStateECES_SM2;
extern "C" {
    pub fn ippcpGetCpuFeatures(pFeaturesMask: *mut Ipp64u) -> IppStatus;
}
extern "C" {
    pub fn ippcpSetCpuFeatures(features: Ipp64u) -> IppStatus;
}
extern "C" {
    pub fn ippcpGetEnabledCpuFeatures() -> Ipp64u;
}
extern "C" {
    pub fn ippcpSetNumThreads(numThr: ::std::os::raw::c_int) -> IppStatus;
}
extern "C" {
    pub fn ippcpInit() -> IppStatus;
}
extern "C" {
    pub fn ippcpGetNumThreads(pNumThr: *mut ::std::os::raw::c_int) -> IppStatus;
}
extern "C" {
    pub fn ippcpGetStatusString(StsCode: IppStatus) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ippcpGetEnabledNumThreads() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ippcpGetCpuClocks() -> Ipp64u;
}
extern "C" {
